chakrounanas.turbo-console-log
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
continue.continue
dbaeumer.vscode-eslint
devsense.composer-php-vscode
devsense.intelli-php-vscode
devsense.phptools-vscode
devsense.profiler-php-vscode
eamodio.gitlens
github.copilot
github.copilot-chat
google.gemini-cli-vscode-ide-companion
jasonnutter.search-node-modules
jawandarajbir.react-vscode-extension-pack
koihik.vscode-lua-format
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.cpptools
ms-vscode.powershell
ms-vscode.vscode-serial-monitor
redhat.java
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vsciot-vscode.vscode-arduino
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vue.volar
xabikos.javascriptsnippets
xabikos.reactsnippets
yinfei.luahelper
